import NavLink from "@/components/common/NavLink";
import React from "react";


const HomeSummary = () => {
  return (
    <div className='bg-[#ffffff] py-20'>
    <div className='w-screen max-w-[1400px] mx-auto px-8 md:px-16'>
        <div className='grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-x-20 gap-y-24'>
            <div className='flex flex-col gap-6 justify-center items-center'>
                <h2 className='text-xl font-bold text-black '>اخبار</h2>
                <img src='/pics/اخبار.jpg' alt='' />
                <p className='line-clamp-2'>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک
                    است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط
                    فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                    کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
                    طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
                    فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                    موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
                    دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار
                    گیردu
                </p>
                <NavLink
                    className='bg-gray-400 hover:bg-gray-500 transition-all p-4 mt-8 text-white rounded-md w-[250px] text-xl font-semibold text-center'
                    href={`/blog?type=news`}
                >
                    {" "}
                    بیشتر
                </NavLink>
            </div>
            <div className='flex flex-col gap-6 justify-center items-center'>
                <h2 className='text-xl font-bold text-black '>مناقصات</h2>
                <img src='/pics/مناقصات و مزایدات.jpg' alt='' />
                <p className='line-clamp-2'>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک
                    است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط
                    فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                    کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
                    طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
                    فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                    موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
                    دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار
                    گیردu
                </p>
                <NavLink
                    className='bg-gray-400 hover:bg-gray-500 transition-all p-4 mt-8 text-white rounded-md w-[250px] text-xl font-semibold text-center'
                    href={`/tender`}
                >
                    {" "}
                    بیشتر
                </NavLink>
            </div>
            <div className='flex flex-col gap-6 justify-center items-center'>
                <h2 className='text-xl font-bold text-black '>نمایشگاه ها</h2>
                <img src='/pics/حضورهای نمایشگاهی.jpg' alt='' />
                <p className='line-clamp-2'>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک
                    است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط
                    فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                    کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
                    طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
                    فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                    موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
                    دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار
                    گیردu
                </p>
                <button className='bg-gray-400 hover:bg-gray-500 transition-all p-4 mt-8 text-white rounded-md w-[250px] text-xl font-semibold'>
                    بیشتر
                </button>
            </div>
            <div className='flex flex-col gap-6 justify-center items-center'>
                <h2 className='text-xl font-bold text-black '>گالری ویدیویی</h2>
                <img src='/pics/گالری ویدیویی.jpg' alt='' />
                <p className='line-clamp-2'>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک
                    است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط
                    فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                    کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
                    طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
                    فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                    موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
                    دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار
                    گیردu
                </p>
                <button className='bg-gray-400 hover:bg-gray-500 transition-all p-4 mt-8 text-white rounded-md w-[250px] text-xl font-semibold'>
                    بیشتر
                </button>
            </div>
            <div className='flex flex-col gap-6 justify-center items-center'>
                <h2 className='text-xl font-bold text-black '>گزارشات</h2>
                <img src='/pics/گزارشات.jpg' alt='' />
                <p className='line-clamp-2'>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک
                    است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط
                    فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                    کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
                    طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
                    فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                    موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
                    دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار
                    گیردu
                </p>
                <NavLink
                    className='bg-gray-400 hover:bg-gray-500 transition-all p-4 mt-8 text-white rounded-md w-[250px] text-xl font-semibold text-center'
                    href={`/reports`}
                >
                    {" "}
                    بیشتر
                </NavLink>
            </div>
            <div className='flex flex-col gap-6 justify-center items-center'>
                <h2 className='text-xl font-bold text-black '>سهامداران</h2>
                <img src='/pics/سهامداران.jpg' alt='' />
                <p className='line-clamp-2'>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک
                    است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط
                    فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                    کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
                    طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و
                    فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                    موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
                    دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار
                    گیردu
                </p>

                <NavLink
                    className='bg-gray-400 hover:bg-gray-500 transition-all p-4 mt-8 text-white rounded-md w-[250px] text-xl font-semibold text-center'
                    href={`/shareholders`}
                >
                    {" "}
                    بیشتر
                </NavLink>
            </div>
        </div>
    </div>
</div>
  )
};

export default HomeSummary;
